# PlumbingFlowCalculatorNotAvailable Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPCalculationFailures..::..PlumbingFlowCalculatorNotAvailable Property
BuiltInFailures..::..MEPCalculationFailures Class See Also
---
Plumbing Flow Calculator Not Available: [Calculator Name]
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId PlumbingFlowCalculatorNotAvailable { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PlumbingFlowCalculatorNotAvailable As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ PlumbingFlowCalculatorNotAvailable {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPCalculationFailures Class
Autodesk.Revit.DB Namespace